<?php

// echo " >>>>> get_theme_file_path( " . get_theme_file_path() . ") ";

  // *******************************************************
  // *******************************************************
  // ★ モバイル or パソコン判定
  // *******************************************************
  // *******************************************************
  require_once get_theme_file_path( '/func/Mobile_Detect.php' );
  // インスタンスを生成
  $detect = new Mobile_Detect;
  $GB_MOBILE_FLAG = false;
  // メソッド isMobile() はデバイスがスマホまたはタブレットの場合 true を返す
  if ( $detect->isMobile() ) {
    $GB_MOBILE_FLAG = true;
  }

  // $GB_MOBILE_FLAG = true;   // for DEBUG !!!!!
  // $GB_MOBILE_FLAG = true;   // for DEBUG !!!!!
  // $GB_MOBILE_FLAG = true;   // for DEBUG !!!!!
  // $GB_MOBILE_FLAG = true;   // for DEBUG !!!!!
  // $GB_MOBILE_FLAG = true;   // for DEBUG !!!!!

  // 
  // *******************************************************
  // *******************************************************
  // ★ 【独自スタイルシート】の取込み
  // *******************************************************
  // *******************************************************
  require_once get_theme_file_path( '/func/myStyleSheet.php' );

  // 
  // *******************************************************
  // *******************************************************
  // ★ 【JavaScriptファイル】の取込み
  // *******************************************************
  // *******************************************************
  require_once get_theme_file_path( '/func/myJavaScript.php' );

  // 
  // *******************************************************
  // *******************************************************
  // ★ 【投稿】のアーカイブページを作成する
  // *******************************************************
  // *******************************************************
  function post_has_archive($args, $post_type)
  {
      if ('post' == $post_type) {
          $args['rewrite']     = true;   // リライトを有効にする
          $args['has_archive'] = 'blog'; // 任意のスラッグ名
      }
      return $args;
  }
  add_filter('register_post_type_args', 'post_has_archive', 10, 2);

  // 
  // *******************************************************
  // *******************************************************
  // ★ 【投稿一覧：fron-page.php】クリックからの、
  //  　【投稿個別ページ：single.php】へのURL内引数「.../?p=ID」、
  //  　【p=ID】の「#ID」を取得する為の設定。
  // *******************************************************
  // *******************************************************
  function add_query_vars_filter( $vars ){
    $vars[] = "p";
    return $vars;
  }
  add_filter( 'query_vars', 'add_query_vars_filter' );

  // 
  // *******************************************************************************
  // *******************************************************************************
  // *******************************************************************************
  // *******************************************************************************
  // *******************************************************************************
  // ★ ブロックエディタに適用したい【CSSファイル】の読み込み
  // 
  // 【参考】「https://rfs.jp/sb/wordpress/wp-lab/add-block-style.html」
  // 　　　　「https://webnote.i-sight.jp/gutenberg-block-editor-css/」
  // *******************************************************
  // *******************************************************
  // require_once get_theme_file_path( '/func/NoUse_blockEditorCss.php' );

  // *******************************************************
  // *******************************************************
  // ★ ブロックエディタに適用したい【CSSスタイル】の設定
  // 
  //  ☛ 投稿ページにのみCSSをインラインで追加
  // 　　上の方法では、ファイル読込み禁止エラーが発生してしまう！
  // 
  // 【参考】「https://fit-jp.com/custom-css-is-single/」
  // *******************************************************
  // *******************************************************
  // require_once get_theme_file_path( '/func/styleDef-blockEditor.php' );

  // *******************************************************
  // *******************************************************
  // ★ 投稿ページ：カテゴリー表示関連関数群
  // *******************************************************
  // *******************************************************
  require_once get_theme_file_path( '/func/categoryCtr.php' );

  // 
  // GoogleSearchConsole でのリダイレクトエラー防止策 
  //旧スラッグからの自動補完リダイレクトを停止
  remove_action( 'template_redirect', 'wp_old_slug_redirect' );

?>