
<!--  -->
<!-- *************************************************** -->
<!-- *************************************************** -->
<!-- *************************************************** -->
<!--                                                     -->
<!-- ■ サイドバー内検索機能クリック時、呼出されるコード -->
<!-- 　1. 【sidebar-archiveList.php】上検索虫眼鏡時、呼出される -->
<!--                                                     -->
<!-- *************************************************** -->
<!-- *************************************************** -->
<!-- *************************************************** -->
<!--  -->

<?php // if (isset($_GET['s']) && empty($_GET['s'])): ?>

<?php
/*
Template Name: 検索結果一覧表示ページ用テンプレート
*/

  $GB_menuPos    = 405;
  $GB_page_flag  = 0;
  $GB_iconDspCtr = 0;
  $error_flag    = 0;

  // 
  // カテゴリ情報があれば・・・
  if (isset($_GET['s']) && empty($_GET['s']))  {
    $GB_blogListTitle = "　■ 検索条件が入力されていません！";
    $error_flag = 1;
  } else  {
    $GB_blogListTitle = "　■ 検索条件【" . $_GET['s'] . "】";
    // $categoryInfo    = get_category( $cat );
    // $GB_categoryType = $categoryInfo->cat_name;
    // $GB_currentCatID = $categoryInfo->cat_ID;
  }
  
  // ヘッダー部の取込み
  get_header();

?>

  <!--  -->
  <!-- **************************************************** -->
  <!-- **************************************************** -->
  <!-- ■ pageComElmDspCtr 表示ID切り替え用スイッチ設定 -->
  <!-- ★ スクロール時表示・非表示する、固定位置表示ナビゲーションメニューの制御関連 -->
  <!--    1．入力フォーム・データ確認画面ではこれを表示していない。　　　　　　　 -->
  <!--    2．Javascript/スクロールに応じた表示コントロールにてエラーが発生する。 -->
  <!-- **************************************************** -->
  <div id="pageFlag" title="0"></div>
  <!-- **************************************************** -->
  <div class="mainContents">
    <!-- <p>
      <br><br>
      　検索結果表示ページ【search.php】<br>
      <br><br>
    </p> -->

    <!--  -->
    <!-- ************************************************************ -->
    <!-- ************************************************************ -->
    <?php include( get_template_directory() . "/searchListDspCtr.php" ); ?>
    <!-- ************************************************************ -->
    <!-- ************************************************************ -->

  </div>    <!-- mainContents -->

<!-- フッター部の取込み -->
<?php get_footer(); ?>
